# Задача 32: Определить индексы элементов массива (списка), значения которых принадлежат 
# заданному диапазону (т.е. не меньше заданного минимума и не больше заданного максимума)

n = int(input('Введите колличество элементов массива: '))
array = list()
for i in range(n): 
    a = int(input('Введите элемент массива: ')) 
    array.append(a)
print(f'Наш массив {array}')
max = int(input('Введите максимум: '))
min = int(input('Введите минимум: '))   
for i in range(len(array)):
    if max>= array[i]>=min:
        print(f'Элемент с индексом {i} попадает в диапазон')  