# Задача 30: Заполните массив элементами арифметической прогрессии. Её первый элемент, 
# разность и количество элементов нужно ввести с клавиатуры. Формула для получения n-го 
# члена прогрессии: an = a1 + (n-1) * d.
# Каждое число вводится с новой строки.

n = int(input('Введите колличество элементов: '))
a = int(input('Введите первый элемент: '))
d = int(input('Введите коэфициент: '))

for i in range(n): 
    k = a + i * d
    print(k)